
// Преобразует таблицу значений в массив структур.
пакет = ОбщегоНазначения.ТаблицаЗначенийВМассив(тз);

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки
естьСсылка = ОбщегоНазначения.СсылкаСуществует(Пользователь);

//
ОбщегоНазначения.ЗначениеРеквизитаОбъекта
				.ЗначенияРеквизитовОбъектов	
				
ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта
							  .ЗначенияРеквизитовОбъекта	
ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь)
СклонениеПредставленийОбъектов.ПросклонятьФИО()	
							  


Автообновление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ИнтеграцияС1СДокументооборот", "Автообновление", Истина);
ПериодАвтообновления = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ИнтеграцияС1СДокументооборот", "ПериодАвтообновления", 60);

ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "УУАЗ_ПредусмотреныОриентировочныеЦены")

рекв = УправлениеСвойствами.ЗначениеСвойства(Форма.Объект.Склад, "ИнтеграцияСWMS");
ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТоварыУстановитьЕдиницуИзмеренияПоУмолчанию", "Видимость", Ложь);


СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса = УУАЗ_ТекстЗапросаСписокРаспоряженияНаПоступление(СписокРаспоряженияНаПоступление.ТекстЗапроса);
	СвойстваСписка.ОсновнаяТаблица = "";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Неопределено;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокРаспоряженияНаПоступление, СвойстваСписка);


//1. ДОБАВИТЬ К ССЫЛКЕ ПРИСОЕДИНЕННЫЙ ФАЙЛ
СтруктураДО.Вставить("ОписаниеОповещения", ОповещениеПослеВыбораФайлаПодтверждающегоДокумента);
ОбработчикРезультата = Новый ОписаниеОповещения("ПослеВыбораФайла",ЭтотОбъект, СтруктураДО);
РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ЭтотОбъект.УникальныйИдентификатор,,,ОбработчикРезультата);	

//2.
ИнтеграцияС1СДокументооборотКлиент.СоздатьФайлСДискаПослеДиалогаВыбораФайла(ВыбранныеФайлы,ДопПараметры);		
